In [1]:
import pandas as pd

In [3]:
df_custormer = pd.read_csv("/home/brilly/Documents/sql_join/customers.csv")
df_order_items = pd.read_csv("/home/brilly/Documents/sql_join/order_items.csv")
df_orders = pd.read_csv("/home/brilly/Documents/sql_join/orders.csv")
df_products = pd.read_csv("/home/brilly/Documents/sql_join/product.csv")


df_custormer.info()
df_order_items.info()
df_orders.info()
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    4 non-null      int64
 1   customer_name  4 non-null      object
 2   email          4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    8 non-null      int64
 1   product_id  8 non-null      int64
 2   quantity    8 non-null      int64
dtypes: int64(3)
memory usage: 324.0 bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     5 non-null      int64
 1   customer_id  5 non-null      int64
 2   order_date   5 non-null      object
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    5 non-null      int64
 1   product_name  5 non-null      object
 2   price         5 non-null      int64
 3   category_id   5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [4]:
df_custormer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    4 non-null      int64
 1   customer_name  4 non-null      object
 2   email          4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [5]:
df_order_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    8 non-null      int64
 1   product_id  8 non-null      int64
 2   quantity    8 non-null      int64
dtypes: int64(3)
memory usage: 324.0 bytes

In [6]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     5 non-null      int64
 1   customer_id  5 non-null      int64
 2   order_date   5 non-null      object
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [7]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    5 non-null      int64
 1   product_name  5 non-null      object
 2   price         5 non-null      int64
 3   category_id   5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [ ]:
import polars as pl
import datetime as dt

df_polars = pl.DataFrame(
    {
        "name": ["Alice Archer", "Ben Brown", "Chloe Cooper", "Daniel Donovan"],
        "birthdate": [
            dt.date(1997, 1, 10),
            dt.date(1985, 2, 15),
            dt.date(1983, 3, 22),
            dt.date(1981, 4, 30),
        ],
        "weight": [57.9, 72.5, 53.6, 64.2],  # (kg)
        "height": [1.56, 1.77, 1.65, 1.75],  # (m)
        "ayam": []
    }
)

df_polars.to_pandas()

# df_polars.head(4)

# df_polars.describe()
df_polars.null_count()

# df_polars.select(pl.col("birthdate").filter(pl.col("height") > 1.7))

# df_polars.filter(pl.col("height") > 1.0).head(1)

shape: (1, 4)
┌──────┬───────────┬────────┬────────┐
│ name ┆ birthdate ┆ weight ┆ height │
│ ---  ┆ ---       ┆ ---    ┆ ---    │
│ u32  ┆ u32       ┆ u32    ┆ u32    │
╞══════╪═══════════╪════════╪════════╡
│ 0    ┆ 0         ┆ 0      ┆ 0      │
└──────┴───────────┴────────┴────────┘

In [3]:
import modin.config as cfg

print("Engine", cfg.Engine.get())

2025-08-07 14:16:36,528	INFO util.py:154 -- Outdated packages:
  ipywidgets==7.8.1 found, needs ipywidgets>=8
Run `pip install -U ipywidgets`, then restart the notebook server for rich notebook output.

Engine Ray

In [6]:
import modin.config as cfg
cfg.Engine.put("ray")  # pastikan Ray digunakan

import modin.pandas as pd

# Coba baca file CSV kecil atau buat DataFrame
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]])
print(df.head())

   0  1  2
0  1  2  3
1  4  5  6

In [3]:
import pandas as pd 

df = pd.read_csv("/home/brilly/myskill_or_anything/belajar_sql_for_analisis/14. SQL Practice/ds_salaries.csv")

df.info()

df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [3]:
import polars as pl

df_pl = pl.read_csv("/home/brilly/myskill_or_anything/belajar_sql_for_analisis/14. SQL Practice/ds_salaries.csv")

# df_pl.head()

df_pl.fill_null(0)

shape: (607, 12)
┌─────┬───────────┬────────────┬────────────┬───┬────────────┬────────────┬────────────┬───────────┐
│     ┆ work_year ┆ experience ┆ employment ┆ … ┆ employee_r ┆ remote_rat ┆ company_lo ┆ company_s │
│ --- ┆ ---       ┆ _level     ┆ _type      ┆   ┆ esidence   ┆ io         ┆ cation     ┆ ize       │
│ i64 ┆ i64       ┆ ---        ┆ ---        ┆   ┆ ---        ┆ ---        ┆ ---        ┆ ---       │
│     ┆           ┆ str        ┆ str        ┆   ┆ str        ┆ i64        ┆ str        ┆ str       │
╞═════╪═══════════╪════════════╪════════════╪═══╪════════════╪════════════╪════════════╪═══════════╡
│ 0   ┆ 2020      ┆ MI         ┆ FT         ┆ … ┆ DE         ┆ 0          ┆ DE         ┆ L         │
│ 1   ┆ 2020      ┆ SE         ┆ FT         ┆ … ┆ JP         ┆ 0          ┆ JP         ┆ S         │
│ 2   ┆ 2020      ┆ SE         ┆ FT         ┆ … ┆ GB         ┆ 50         ┆ GB         ┆ M         │
│ 3   ┆ 2020      ┆ MI         ┆ FT         ┆ … ┆ HN         ┆ 0          ┆ HN         ┆ S         │
│ 4   ┆ 2020      ┆ SE         ┆ FT         ┆ … ┆ US         ┆ 50         ┆ US         ┆ L         │
│ …   ┆ …         ┆ …          ┆ …          ┆ … ┆ …          ┆ …          ┆ …          ┆ …         │
│ 602 ┆ 2022      ┆ SE         ┆ FT         ┆ … ┆ US         ┆ 100        ┆ US         ┆ M         │
│ 603 ┆ 2022      ┆ SE         ┆ FT         ┆ … ┆ US         ┆ 100        ┆ US         ┆ M         │
│ 604 ┆ 2022      ┆ SE         ┆ FT         ┆ … ┆ US         ┆ 0          ┆ US         ┆ M         │
│ 605 ┆ 2022      ┆ SE         ┆ FT         ┆ … ┆ US         ┆ 100        ┆ US         ┆ M         │
│ 606 ┆ 2022      ┆ MI         ┆ FT         ┆ … ┆ IN         ┆ 100        ┆ US         ┆ L         │
└─────┴───────────┴────────────┴────────────┴───┴────────────┴────────────┴────────────┴───────────┘